sys_bench/fio/1st/4k.write.fio.output
job1: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=200
job2: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=200
job3: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=200
job4: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=200
job5: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=200
job6: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=200
job7: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=200
job8: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=200
fio-3.1
Starting 8 processes

job1: (groupid=0, jobs=1): err= 0: pid=73234: Thu Feb  7 07:51:46 2019
  write: IOPS=20.5k, BW=79.0MiB/s (83.9MB/s)(4799MiB/60007msec)
    slat (usec): min=2, max=4439, avg=45.97, stdev=247.34
    clat (usec): min=1185, max=83835, avg=9720.79, stdev=3880.82
     lat (usec): min=1198, max=83839, avg=9766.82, stdev=3886.38
    clat percentiles (usec):
     |  1.00th=[ 3949],  5.00th=[ 4883], 10.00th=[ 5538], 20.00th=[ 6521],
     | 30.00th=[ 7504], 40.00th=[ 8455], 50.00th=[ 9372], 60.00th=[10290],
     | 70.00th=[11338], 80.00th=[12387], 90.00th=[13829], 95.00th=[15008],
     | 99.00th=[21890], 99.50th=[28705], 99.90th=[42206], 99.95th=[47973],
     | 99.99th=[58983]
   bw (  KiB/s): min=67496, max=102987, per=10.50%, avg=82395.28, stdev=7793.21, samples=120
   iops        : min=16874, max=25746, avg=20598.46, stdev=1948.24, samples=120
  lat (msec)   : 2=0.01%, 4=1.10%, 10=55.36%, 20=42.25%, 50=1.24%
  lat (msec)   : 100=0.04%
  cpu          : usr=4.76%, sys=9.90%, ctx=41367, majf=0, minf=253
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=0,1228562,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=200
job2: (groupid=0, jobs=1): err= 0: pid=73235: Thu Feb  7 07:51:46 2019
  write: IOPS=25.9k, BW=101MiB/s (106MB/s)(6070MiB/60007msec)
    slat (usec): min=2, max=6478, avg=35.74, stdev=179.93
    clat (usec): min=881, max=71258, avg=7686.11, stdev=3320.52
     lat (usec): min=887, max=71262, avg=7721.92, stdev=3325.31
    clat percentiles (usec):
     |  1.00th=[ 3261],  5.00th=[ 3687], 10.00th=[ 4015], 20.00th=[ 4948],
     | 30.00th=[ 5932], 40.00th=[ 6456], 50.00th=[ 7373], 60.00th=[ 8291],
     | 70.00th=[ 8848], 80.00th=[ 9765], 90.00th=[10814], 95.00th=[11600],
     | 99.00th=[20579], 99.50th=[24249], 99.90th=[34341], 99.95th=[39060],
     | 99.99th=[47973]
   bw (  KiB/s): min=94197, max=123111, per=13.28%, avg=104265.20, stdev=4548.21, samples=120
   iops        : min=23549, max=30777, avg=26065.97, stdev=1137.04, samples=120
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.03%, 4=9.77%, 10=73.02%, 20=16.09%, 50=1.08%
  lat (msec)   : 100=0.01%
  cpu          : usr=6.36%, sys=12.24%, ctx=71269, majf=0, minf=276
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=0,1553816,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=200
job3: (groupid=0, jobs=1): err= 0: pid=73236: Thu Feb  7 07:51:46 2019
  write: IOPS=25.6k, BW=99.9MiB/s (105MB/s)(5993MiB/60015msec)
    slat (usec): min=2, max=7462, avg=36.30, stdev=185.22
    clat (usec): min=845, max=102486, avg=7785.33, stdev=3793.24
     lat (usec): min=849, max=102490, avg=7821.70, stdev=3798.22
    clat percentiles (usec):
     |  1.00th=[ 2868],  5.00th=[ 3556], 10.00th=[ 3916], 20.00th=[ 4817],
     | 30.00th=[ 5669], 40.00th=[ 6456], 50.00th=[ 7308], 60.00th=[ 8160],
     | 70.00th=[ 8979], 80.00th=[ 9896], 90.00th=[11076], 95.00th=[13960],
     | 99.00th=[22414], 99.50th=[25560], 99.90th=[35914], 99.95th=[40109],
     | 99.99th=[50070]
   bw (  KiB/s): min=90032, max=128472, per=13.11%, avg=102881.26, stdev=6114.80, samples=120
   iops        : min=22508, max=32118, avg=25719.98, stdev=1528.72, samples=120
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.04%, 4=11.11%, 10=70.66%, 20=16.46%, 50=1.72%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=6.47%, sys=11.57%, ctx=64527, majf=0, minf=259
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=0,1534213,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=200
job4: (groupid=0, jobs=1): err= 0: pid=73237: Thu Feb  7 07:51:46 2019
  write: IOPS=25.3k, BW=98.9MiB/s (104MB/s)(5934MiB/60012msec)
    slat (usec): min=2, max=9202, avg=36.67, stdev=189.63
    clat (usec): min=677, max=73070, avg=7862.38, stdev=3342.87
     lat (usec): min=681, max=73073, avg=7899.11, stdev=3347.61
    clat percentiles (usec):
     |  1.00th=[ 3163],  5.00th=[ 3720], 10.00th=[ 4293], 20.00th=[ 5145],
     | 30.00th=[ 5932], 40.00th=[ 6783], 50.00th=[ 7504], 60.00th=[ 8291],
     | 70.00th=[ 9110], 80.00th=[10028], 90.00th=[11338], 95.00th=[12518],
     | 99.00th=[20055], 99.50th=[24249], 99.90th=[34866], 99.95th=[39060],
     | 99.99th=[47973]
   bw (  KiB/s): min=86012, max=133155, per=12.99%, avg=101956.03, stdev=10263.34, samples=120
   iops        : min=21503, max=33288, avg=25488.67, stdev=2565.78, samples=120
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.04%, 4=7.13%, 10=72.66%, 20=19.17%, 50=0.99%
  lat (msec)   : 100=0.01%
  cpu          : usr=6.09%, sys=12.21%, ctx=77673, majf=0, minf=525
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=0,1519106,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=200
job5: (groupid=0, jobs=1): err= 0: pid=73238: Thu Feb  7 07:51:46 2019
  write: IOPS=25.6k, BW=99.9MiB/s (105MB/s)(5996MiB/60013msec)
    slat (usec): min=2, max=6127, avg=36.21, stdev=183.70
    clat (usec): min=697, max=69842, avg=7781.33, stdev=3886.13
     lat (usec): min=700, max=69846, avg=7817.61, stdev=3891.21
    clat percentiles (usec):
     |  1.00th=[ 2802],  5.00th=[ 3490], 10.00th=[ 3818], 20.00th=[ 4752],
     | 30.00th=[ 5604], 40.00th=[ 6390], 50.00th=[ 7177], 60.00th=[ 8029],
     | 70.00th=[ 8979], 80.00th=[ 9896], 90.00th=[11469], 95.00th=[14615],
     | 99.00th=[22414], 99.50th=[25297], 99.90th=[35914], 99.95th=[40633],
     | 99.99th=[51119]
   bw (  KiB/s): min=91070, max=126298, per=13.11%, avg=102926.57, stdev=5865.68, samples=120
   iops        : min=22767, max=31574, avg=25731.35, stdev=1466.43, samples=120
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.07%, 4=11.54%, 10=69.88%, 20=16.71%, 50=1.79%
  lat (msec)   : 100=0.01%
  cpu          : usr=6.19%, sys=11.74%, ctx=97203, majf=0, minf=268
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=0,1534950,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=200
job6: (groupid=0, jobs=1): err= 0: pid=73239: Thu Feb  7 07:51:46 2019
  write: IOPS=25.6k, BW=99.0MiB/s (105MB/s)(6000MiB/60019msec)
    slat (usec): min=2, max=7250, avg=36.17, stdev=183.42
    clat (usec): min=792, max=74151, avg=7777.41, stdev=3960.83
     lat (usec): min=795, max=74155, avg=7813.65, stdev=3966.00
    clat percentiles (usec):
     |  1.00th=[ 2704],  5.00th=[ 3490], 10.00th=[ 3752], 20.00th=[ 4752],
     | 30.00th=[ 5604], 40.00th=[ 6325], 50.00th=[ 7177], 60.00th=[ 8094],
     | 70.00th=[ 8848], 80.00th=[ 9765], 90.00th=[11207], 95.00th=[14877],
     | 99.00th=[23200], 99.50th=[26084], 99.90th=[35914], 99.95th=[40109],
     | 99.99th=[50070]
   bw (  KiB/s): min=92412, max=134260, per=13.13%, avg=103071.72, stdev=5851.21, samples=120
   iops        : min=23103, max=33565, avg=25767.58, stdev=1462.80, samples=120
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.06%, 4=12.43%, 10=69.64%, 20=15.82%, 50=2.04%
  lat (msec)   : 100=0.01%
  cpu          : usr=6.08%, sys=11.90%, ctx=100069, majf=0, minf=250
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=0,1535888,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=200
job7: (groupid=0, jobs=1): err= 0: pid=73240: Thu Feb  7 07:51:46 2019
  write: IOPS=25.9k, BW=101MiB/s (106MB/s)(6064MiB/60006msec)
    slat (usec): min=2, max=31577, avg=35.79, stdev=187.53
    clat (usec): min=764, max=68550, avg=7693.19, stdev=3083.69
     lat (usec): min=767, max=68553, avg=7729.05, stdev=3088.52
    clat percentiles (usec):
     |  1.00th=[ 3326],  5.00th=[ 3785], 10.00th=[ 4424], 20.00th=[ 5080],
     | 30.00th=[ 5997], 40.00th=[ 6652], 50.00th=[ 7439], 60.00th=[ 8291],
     | 70.00th=[ 8979], 80.00th=[ 9896], 90.00th=[10814], 95.00th=[11469],
     | 99.00th=[17695], 99.50th=[23200], 99.90th=[34866], 99.95th=[39584],
     | 99.99th=[50594]
   bw (  KiB/s): min=97191, max=122965, per=13.26%, avg=104120.03, stdev=4283.39, samples=120
   iops        : min=24297, max=30741, avg=26029.70, stdev=1070.82, samples=120
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.03%, 4=7.10%, 10=74.79%, 20=17.32%, 50=0.75%
  lat (msec)   : 100=0.01%
  cpu          : usr=6.17%, sys=12.25%, ctx=91981, majf=0, minf=11
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=0,1552371,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=200
job8: (groupid=0, jobs=1): err= 0: pid=73241: Thu Feb  7 07:51:46 2019
  write: IOPS=21.0k, BW=85.9MiB/s (90.1MB/s)(5154MiB/60007msec)
    slat (usec): min=2, max=10069, avg=42.69, stdev=227.12
    clat (usec): min=1262, max=82253, avg=9050.46, stdev=3649.12
     lat (usec): min=1265, max=82258, avg=9093.21, stdev=3654.33
    clat percentiles (usec):
     |  1.00th=[ 3752],  5.00th=[ 4555], 10.00th=[ 5211], 20.00th=[ 6063],
     | 30.00th=[ 6980], 40.00th=[ 7832], 50.00th=[ 8717], 60.00th=[ 9634],
     | 70.00th=[10552], 80.00th=[11469], 90.00th=[12649], 95.00th=[13829],
     | 99.00th=[21365], 99.50th=[27132], 99.90th=[40109], 99.95th=[45351],
     | 99.99th=[57410]
   bw (  KiB/s): min=67784, max=110599, per=11.28%, avg=88581.22, stdev=6947.07, samples=120
   iops        : min=16946, max=27649, avg=22144.92, stdev=1736.73, samples=120
  lat (msec)   : 2=0.01%, 4=1.82%, 10=62.42%, 20=34.54%, 50=1.19%
  lat (msec)   : 100=0.03%
  cpu          : usr=5.23%, sys=10.44%, ctx=42187, majf=0, minf=15
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=0,1319551,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=200

Run status group 0 (all jobs):
  WRITE: bw=767MiB/s (804MB/s), 79.0MiB/s-101MiB/s (83.9MB/s-106MB/s), io=44.9GiB (48.2GB), run=60006-60019msec

Disk stats (read/write):
  sdb: ios=0/1212499, merge=0/16065, ticks=0/8466622, in_queue=8469285, util=99.97%
  sdc: ios=0/1533644, merge=0/20175, ticks=0/8471885, in_queue=8475477, util=100.00%
  sdd: ios=0/1515823, merge=0/18393, ticks=0/8450799, in_queue=8452983, util=100.00%
  sde: ios=0/1501482, merge=0/17626, ticks=0/8424886, in_queue=8427907, util=100.00%
  sdf: ios=0/1516616, merge=0/18334, ticks=0/8445172, in_queue=8447270, util=100.00%
  sdg: ios=0/1517361, merge=0/18529, ticks=0/8451931, in_queue=8456202, util=100.00%
  sdh: ios=0/1532699, merge=0/19674, ticks=0/8424514, in_queue=8431268, util=100.00%
  sdi: ios=0/1303696, merge=0/15859, ticks=0/8459366, in_queue=8462021, util=100.00%